Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སྲིད་པའི་རྙེད་པ་དང་། ཆགས་པ་དང་། བཀུར་སྟི་ལ་མི་ལྟ་བ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་། གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: They had no regard for worldly profit, passion, or acclaim. They became objects of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་དེད་དཔོན་འདི་ལ་བརྟེན་ཏེ།
en: “Lord,” the monks requested of the Blessed Buddha, “tell us why the five hundred merchants entrusted themselves to the captain,

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇིགས་པ་ཆེན་པོ་ལས་བསྐྱབས་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས།
en: and the Blessed One granted them refuge from fear and established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཀྱིས། དེད་དཔོན་འདི་ལ་བརྟེན་ཏེ།
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, all five hundred merchants entrusted themselves to that captain,

source: ངས་འཇིགས་པ་ཆེན་པོ་ལས་བསྐྱབས་ནས། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་ཅི་ལྟར་བཀོད་པ་དེ་ཉོན་ཅིག །
en: and I granted them refuge from fear and placed them in the four meditative states and the five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ།
en: “Monks, in times gone by, in the city of Vārāṇasī there lived in a place devoted to austerities a certain sage who had all the five superknowledges,

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་ཏེ། དེ་ཡང་བཱ་རཱ་ཎ་སཱི་ན་གནས་པའི་སྐྱེ་བོ་མང་པོས་བཀུར་སྟིར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། རི་མོར་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་ཞིག་གོ། །
en: a person of great miracles and great power, whom the inhabitants of Vārāṇasī held in high esteem and revered, and to whom they offered honor and worship.

source: དེ་ནས་ཕྱི་ཞིག་ན་བཱ་རཱ་ཎ་སཱི་ན་ཚོང་པ་ལྔ་བརྒྱ་ཙམ་གྱིས། དྲང་སྲོང་དེ་ལ་བསྙེན་བཀུར་བྱས་ནས། རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་སོང་སྟེ།
en: “One day some five hundred merchants who held the sage in high esteem set out on the great ocean.

source: དེ་དག་གི་རིན་པོ་ཆེའི་གླིང་བགྲོད་པ་བསྒྲུབས་ནས། ཕྱིར་འཛམ་བུའི་གླིང་ལོགས་སུ་ཆས་པ་ལས། དེ་དག་གི་གྲུ་བོ་ཆེ་རྒྱ་མཚོའི་དུས་རླབས་ཀྱིས་ཐང་ལ་འཕངས་ནས།
en: After they completed their crossing to Ratnadvīpa and were returning to Jambudvīpa, their ship ran aground because of the ocean’s tide.

source: དེ་དག་དེར་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་ཏེ།
en: They were terrified, and thinking,

source: བདག་ཅག་འཚོ་བའི་དུས་སྐབས་མེད་དོ་སྙམ་ནས།
en: ‘There’s no way we’ll survive,’

source: དེ་དག་ལྷ་རྣམས་ལ་གསོལ་བ་འདེབས་པར་བྱེད་དོ། །
en: they began praying to the deities.

source: དེ་ནས་དེད་དཔོན་གྱིས་སྨྲས་པ།
en: Then the captain said,

source: བདག་ཅག་གིས་ལྷ་གཞན་དག་ལ་གསོལ་བ་གདབ་ཅི་དགོས།
en: ‘What need is there to pray to other deities?

source: བདག་ཅག་དྲང་སྲོང་དེ་ཉིད་ལ་སྐྱབས་སུ་འགྲོ་བར་བྱའོ། །
en: It’s to the sage we should go for refuge.

source: འོན་ཀྱང་དེས་བདག་ཅག་ཕོངས་ཤིང་དཀོས་ཐག་པ་དང་། གནོད་པ་དང་ཕྲད་པ་ལ་སྐྱབས་བྱེད་པར་འགྱུར་ཞིང་།
en: He will grant us refuge from meeting with misfortune, suffering, and harm.

source: སྲོག་ཕངས་པ་སྦྱིན་པར་བྱེད་དོ།
en: He will save our precious lives.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག ། ཏུ་ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་དྲང་སྲོང་དེ་ཁོ་ན་ལ་སྐྱབས་སུ་དོང་ངོ་། །
en: No sooner had the five hundred merchants heard this than all took refuge in the sage.

source: དེ་ནས་དྲང་སྲོང་དེ་ལ་དགའ་བའི་ལྷས་དྲང་སྲོང་དེ་ལ་སྦྲན་ནས།
en: “At this a god who was fond of the sage called out to him,

source: དྲང་སྲོང་དེས་ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་རྫུ་འཕྲུལ་གྱིས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་ཕྱུང་སྟེ། རང་གི་དཀའ་ཐུབ་ཀྱི་ཚལ་དུ་བཀོད་དོ། །
en: and by means of a miracle the sage pulled all five hundred merchants out of the ocean and set them down in his forest devoted to austerities.

source: བདག་ཅག་གསོན་པོར་གྱུར་པ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་དྲང་སྲོང་འདིའི་མཐུ་ཡིན་ནོ་སྙམ་ནས།
en: ‘However this happened, the sage is the only reason that we are still alive.’

source: སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ནས།
en: So they gave gifts and made merit,

source: ཐམས་ཅད་དྲང་སྲོང་དེའི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ།
en: and went forth in the presence of the sage.

source: དེ་དག་དེར་རབ་ཏུ་བྱུང་ནས། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: After they went forth, they generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་དེད་དཔོན་དུ་གྱུར་པ་གང་ཡིན་པ་དང་། ཚོང་པར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། ཚོང་བ་འདི་རྣམས་ཁོ་ན་ཡིན་ཏེ།
en: The ones who were the captain and merchants then are none other than these merchants.

source: དེའི་ཚེ་ཡང་འདི་རྣམས་ཀྱིས་དེད་དཔོན་འདི་ཁོ་ན་ལ་བརྟེན་ནས།
en: At that time they entrusted themselves to the captain,

source: ངས་འཇིགས་པ་ཆེན་པོ་ལས་བསྐྱབས་ཏེ། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: and I granted them refuge from fear and placed them in the four meditative states and five superknowledges.

source: ད་ལྟར་ཡང་འདི་རྣམས་ཀྱིས་དེད་དཔོན་འདི་ལ་བརྟེན་ནས།
en: Now as well they have entrusted themselves to the captain,

source: ངས་འཇིགས་པ་ཆེན་པོ་ལས་བསྐྱབས་ཏེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: and I have granted them refuge from fear and established them in the unsurpassed, supreme welfare of nirvāṇa.

source: དེར་འདི་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན།
en: After practicing pure conduct all their lives then, their faculties ripened,

source: ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: and now they have been liberated.”

source: གླུད་ཅེས་བྱ་བ་ནི།
en: The Ransom

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ། ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ། ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་མཉམ་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་
en: When the Blessed One was in Śrāvastī, there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནསདེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: ཁྱིམ་བདག་དེ་ཡང་བུ་མི་གཤིན་པ་ཞིག་སྟེ།
en: The householder’s children were never in good health.

source: བུ་དང་བུ་མོ་བཙས་སོ་ཅོག་འཆི་བར་འགྱུར་རོ། །
en: All those born died, girls and boys alike.

source: ཁྱིམ་བདག་དེའི་བསེན་ནི། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ཡིན་ཏེ། དེས་ཁྱིམ་བདག་དེ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་གནས་པར་བྱས་ནས། སྦྱིན་པ་དག་སྦྱིན་པའི་བགོ་བཤའ་བྱེད་དུ་བཅུག་གོ། །
en: The householder’s spiritual friend, Venerable Aniruddha, led the householder to take refuge and maintain the fundamental precepts, to give gifts, and to share what he had.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: One day the householder’s wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: ཁྱིམ་བདག་དེས་བསམས་པ།
en: As the householder thought,

source: ཐབས་ཅི་ལྟར་བྱས་ན། ཁྱེའུ་འདི་ཚེ་རིང་བར་འགྱུར་ཞིག་གུ་སྙམ་ནས།
en: “How can we ensure that this child will have a long life?”

source: དེའི་བློ་སྐྱེས་པ། འཕགས་པ་མ་འགགས་པ་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་ཞིང་བསོད་ནམས་དང་ལྡན་པ། ཆེ་བར་གྲགས་པ་ཡིན་པས་ན།
en: the thought occurred to him, “Noble Aniruddha is renowned as a person of great miracles and merit.

source: འདི་ལ་བདག་གི་བུ་འདི་གཡོག་ཏུ་ཕུལ་ན། འདིའི་མཐུས་ཚེ་རིང་བར་འགྱུར་ཡང་སྲིད་དོ་སྙམ་ནས།
en: If I grant him my son as an attendant, perhaps his power will ensure the boy’s longevity.”

source: ཕ་མ་གཉིས་ཀྱིས་ཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་ཕུལ་ནས།
en: So the child’s parents granted him to Venerable Aniruddha.

source: དེ་ཉིན་གཅིག་བཞིན་དུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཁྲིད་ཅིང་གསོ་བར་བྱེད་ལ། དགེ་སློང་གི་ཆ་ལུགས་སུ་བཅུག་ནས།
en: Every day the child was led into the garden of Prince Jeta, where he was placed in monks’ care, dressed as a monk,

source: དགེ་སློང་དག་དང་ལྷན་ཅིག་ཏུ་བསོད་སྙོམས་ལ་རྒྱུ་བར་བྱེད་དོ། །
en: and went with the monks for alms.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཤེད་བྱེ་བར་གྱུར་པ་དེའི་ཚེ། ཁྱིམ་བདག་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཁྱིམ་དུ་སྤྱན་དྲངས་ནས།
en: When the child had come into his own, the householder invited the Buddha and the rest of the saṅgha of monks to his house and

source: རང་གི་ལག་ནས་བཟའ་བ་དང་། བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ། ཅི་བཞེད་པ་བསྟབས་ནས།
en: by his own hand he contented them with many good, wholesome foods, proffering all that they wished.

source: ཁྱེའུ་དེའི་གླུད་དུ་གསེར་དངུལ་མང་པོ་ཕུལ་ལོ། །
en: He then offered up much gold and silver in exchange for having kept the boy safe.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཁྱིམ་བདག་དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས། གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: After the Blessed One had instructed, encouraged, inspired, and delighted the householder with a discourse on the Dharma he rose from his seat and departed.

source: བཅོམ་ལྡན་འདས་གཤེགས་ནས། ཁྱིམ་བདག་དེས་ཁྱེའུ་དེའི་ཆོས་གོས་ཚོན་ཅན་རྣམས་ཕུད་དེ།
en: When the Blessed One had gone, the householder removed the young man’s colorful Dharma robes

source: ཁྱིམ་པའི་གོས་དང་རྒྱན་རྣམས་བསྐོན་ནོ། །
en: and dressed him in the clothing and accoutrements of a householder.

source: དེ་ནས་དེའི་ཁྱིམ་པའི་གོས་དང་རྒྱན་བསྐོན་ནོ་ཅོག་མི་སྣང་བར་གྱུར་ཏེ། །
en: But as he did so, the householders’ clothing he had on disappeared and

source: ཆོས་གོས་ཚོན་ཅན་དེ་དག་འབའ་ཞིག་བྱུང་བར་གྱུར་ཏོ། །
en: the colorful religious robes returned.

source: དེ་ནས་གང་གི་ཚེ་ཆ་ལུགས་དེ་བསྒྱུར་མ་ནུས་པ་དེའི་ཚེ། དགེ་སློང་གི་ཆ་ལུགས་སུ་འདུག་བཞིན་དུ་གསོ་བར་བྱེད་དེ།
en: Finally, unable to have his clothes changed, he stayed in monks’ dress and they cared for him all the same.

source: ཁྱིམ་དེ་ཉིད་དུ་ནེའུ་ལྡངས་ཀྱི་གྲོགས་པོ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་ཡི་གེ་སློབ་ཏུ་བཅུག་གོ། །
en: There at home, in the company of five hundred friends of the same age, they educated him in letters and composition.

source: དེ་ནས་དེ་རང་གི་ཁྱིམ་དེར་ཡང་དགའ་བ་མེད་ན། གཞན་དུ་ལྟ་ཅི་སྨོས་ཏེ།
en: The householder’s son was unhappy at home, needless to speak of elsewhere.

source: གཙུག་ལག་ཁང་འབའ་ཞིག་ཏུ་འགྲོ་འདོད་པར་གྱུར་ཏོ། །
en: He wished only to return to the monastery,

source: དེ་ནས་ཁྱིམ་བདག་དེས་བུ་དེ་གཙུག་ལག་ཁང་དུ་ཁྲིད་ནས་དེ་ཉིད་དུ་གསོས་སོ། །
en: so the householder brought him to the monastery and he was raised there.

source: དེ་ནས་དེས་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་པར་གྱུར་ནས། དེ་ཕྱིར་ཁྱིམ་དུ་འགྲོ་མི་འདོད་དོ། །
en: After he had realized all the scriptures there in the monastery, he still had no desire to return home.

source: གཙུག་ལག་ཁང་དུ་འདུག་བཞིན་དུ་དེས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: He manifested the resultant state of stream entry there in the monastery.

source: དེས་བདེན་པ་མཐོང་ནས་ཕ་མ་ལ་གསོལ་ཏེ། ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་ཐད་དུ་རབ་ཏུ་བྱུང་ནས། བསྙེན་པར་རྫོགས་ཏེ། ཚེ་དང་ལྡན་པ་མ་འགགས་པས་དེ་ལ་ལུང་ཡང་ཕོག་ནས།
en: After seeing the truths, he asked for his parents’ permission and went forth in the presence of Venerable Aniruddha, who conferred on him full ordination, and instructed him.

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.

source: དགྲ་བཅོམ་པར་གྱུར་ནས་བསམས་པ།
en: After achieving arhatship, he wondered,

source: བདག་གིས་འདུལ་བར་འགྱུར་བ་འགའ་ལྟ་ཅི་ཡོད་སྙམ་སྟེ།
en: “Whom might I tame?”

source: དེས་བལྟས་ན་བདག་གི་ཕ་མ་ལ་སོགས་པ་ནེའུ་ལྡངས་ཀྱི་གྲོགས་པོ་ལྔ་བརྒྱ་འདུལ་བར་གྱུར་པ་མཐོང་ནས།
en: He looked out, and he saw that he could tame his parents, as well as his five hundred friends of the same age.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: So he disappeared from the garden of Prince Jeta,

source: རང་གི་ཁྱིམ་དུ་ཕ་མ་གཉིས་ཀྱི་མདུན་ནས་ས་བརྟོལ་ཏེ་བྱུང་ངོ་། །
en: and right there in front of his parents burst forth from the floor of their house.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་ཕ་མ་གཉིས་ཀྱིས་དེ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: Upon seeing this, his parents felt a surge of joy toward him,

source: དགའ་བར་གྱུར་ནས་ཆོས་ཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: [felt a surge of joy towards them] and sat before him to listen to the Dharma.

source: དེ་ནས་དེས་ཕ་མ་དེ་གཉིས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་ཤེས་པ་དང་། རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: He directly apprehended their thoughts, habitual tendencies, temperaments, capacities, and natures, and taught them the Dharma accordingly.

source: དེས་ན་ཕ་མ་དེ་གཉིས་འཁོར་དང་བཅས་པ་སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When they heard it, his parents destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: བདེན་པ་མཐོང་ནས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་བཀོད་དེ། སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་ཡང་བྱེད་དུ་བཅུག་ནས། ཁྱིམ་དེ་ཁྲོན་པ་དང་འདྲ་བར་བྱས་ཏེ་བཞག་གོ། །
en: Once they saw the truths, he inspired them to go for refuge, established them in the fundamental precepts, and encouraged them to give gifts and to share what they had, until their home became like an open well for those in need.

source: དེས་ནེའུ་ལྡངས་ཀྱི་གྲོགས་པོ་ལྔ་བརྒྱ་པོ་དེ་དག་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་བཀོད་དོ། །
en: After that he led his five hundred friends of the same age to go for refuge and established them in the fundamental precepts.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ཁྱིམ་བདག་གི་བུ་འདིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ།
en: “Lord,” the monks inquired of the Blessed One, “what action did the householder’s son take that ripened into his birth into a family of great means, prosperity, and wealth;

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ཏེ།
en: and manifested arhatship;

source: འདི་ཉིད་ལ་བརྟེན་ནས་ཕ་མ་ལ་སོགས་པ་དང་། ནེའུ་ལྡངས་ཀྱི་གྲོགས་པོ་ལྔ་བརྒྱས་བདེན་པ་མཐོང་བར་གྱུར་ཏེ།
en: and that by entrusting themselves to him both his parents and his friends of the same age saw the truths,

source: བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: and likewise pleased the Blessed One, and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུས་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན།
en: “Monks,” recounted the Blessed One, “in times past, in this fortunate eon, when people lived as long as twenty thousand years,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་ལས།
en: and the totally and completely awakened buddha endowed with perfect knowledge and perfect conduct, the blessed one, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, there lived a certain householder in the city of Vārāṇasī.

source: ཕྱི་ཞིག་ན་དེའི་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: “One day a child was born to him who was well proportioned, pleasing to the eye, and beautiful.

source: སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: went for refuge, and took the fundamental precepts.

source: དེ་གང་གི་ཉིན་པར་བཙས་པ་དེ་ཁོ་ནའི་ཉིན་པར་ཁྱིམ་བདག་གཞན་གྱི་བུ་ལྔ་བརྒྱ་ཡང་བཙས་ཏེ།
en: On the day he was born five hundred children were born to other householders as well.

source: གང་གི་ཚེ་དེ་དག་ཆེར་སྐྱེས་པ་དེའི་ཚེ་བརྟག་པ་རྣམ་པ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏེ། དེ་ནས་དེ་དག་སོ་སོའི་ཕ་མ་རྣམས་ཀྱིས་མཛའ་སྡེའི་ནང་དུ་བཏང་ངོ་། །
en: When they had grown and been educated in the eight types of examination, each of their parents had them join a social club.

source: དེ་ནས་ཕྱི་ཞིག་ན་དཔྱིད་ཀྱི་དུས་སུ་མཛའ་སྡེ་བོ་དེ་རྣམས་སྐྱེད་མོས་ཚལ་ཤིང་ལྗོན་པ་ཡལ་ག་འཁྲིགས་ཤིང་། མེ་ཏོག་རྒྱས་པའི་ནང་དུ་འགྲོ་འདོད་པར་གྱུར་ནས།
en: “One day in the spring the social club wished to go out into the gardens, where the tree branches had thickened and the flowers were in bloom.

source: ནེའུ་ཟླ་རྣམས་ཀྱིས་ཁྱེའུ་དེ་སྔོན་དུ་བཏང་བར་འདོད་དེ།
en: The young man’s friends of the same age wished to send him on ahead, so they told him,

source: ཁྱོད་སྔར་སོང་ལ་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་གྱིས་ཤིག་དང་། བདག་ཅག་ཀྱང་དོན་གྲུབ་ནས་འོང་ངོ་ཞེས་བྱས་སོ། །
en: ‘You run on ahead to prepare the food and drink, and we’ll follow after we finish some work here.’

source: དེ་ནས་དེ་དེར་སོང་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་དག་སྟ་གོན་བྱས་སོ། །
en: So he went on ahead and prepared many good, wholesome foods.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དང་བཅས་པ་ཡང་ས་ཕྱོགས་དེ་ལོགས་ནས། བཱ་རཱ་ཎ་སཱིར་བསོད་སྙོམས་ལ་ཆས་ཏེ་གཤེགས་སོ། །
en: “As the totally and completely awakened Buddha Kāśyapa and his disciples were passing through the area on their way for alms in Vārāṇasī,

source: དེ་ནས་ཁྱེའུ་དེས་ཐག་རིང་པོ་ཞིག་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དང་བཅས་པ་མཐོང་ངོ་། །
en: the boy saw the totally and completely awakened Buddha Kāśyapa and his disciples from a distance.

source: མཐོང་ནས་ཀྱང་དེས་བསམས་པ།
en: Upon seeing him he thought,

source: ཡོན་གནས་ཀྱི་མཆོག་འདི་ལྟ་བུ་བསོད་སྙོམས་ལ་ཆས་ཏེ་གཤེགས་ལ།
en: ‘One so supremely worthy of offerings, traveling about for alms!

source: བདག་གིས་ཀྱང་ཚེགས་ཆུང་ངུས་བཟའ་བ་དང་བཅའ་བ་དག་སྦྱར་བ་ཡོད་ན
en: I could prepare food and drink for him with little difficulty.

source: བདག་གིས་ཇེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དང་བཅས་པ་ལ་བཤོས་གསོལ་ལ།
en: I will offer a meal to the totally and completely awakened Buddha Kāśyapa and his disciples first.

source: དེའི་འོག་ཏུ་བདག་གིས་གྲོགས་པོ་རྣམས་ཀྱི་བཟའ་བ་དང་བཅའ་བ་གཞན་དག་སྦྱར་བར་བྱའོ་
en: After that I shall prepare my friends’ food and drink.’

source: སྙམ་ནསདེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དང་བཅས་པ་སྐྱེད་མོས་ཚལ་དེ་ཉིད་ཀྱི་ནང་དུ་སྤྱན་དྲངས་ཏེ།
en: “With this thought he invited the totally and completely awakened Buddha Kāśyapa and his disciples into the garden,

source: བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ། ཅི་བཞེད་པ་བསྟབས་ནས་ཆོས་ཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: and after he contented them with many good, wholesome foods, proffering all that they wished, he sat before them to listen to the Dharma.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་དེ་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་མཛད་ནས། གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: After the totally and completely awakened Buddha Kāśyapa had instructed, encouraged, inspired, and delighted him with a discourse on the Dharma he rose from his seat and departed.

source: དེ་ནས་ཁྱེའུ་དེས་མཛའ་སྡེ་བོ་རྣམས་ཀྱི་ཕྱིར་བཟའ་བ་དང་བཅའ་བ་གཞན་དག་སྟ་གོན་བྱེད་པ་ལ་ཞུགས་སོ། །
en: “The young man then began to prepare other food and drink for his social club.

source: དེ་ནས་མཛའ་སྡེ་བོ་དེ་རྣམས་སྐྱེད་མོས་ཚལ་དེར་ལྷགས་ནས།
en: The social club arrived in the garden and heard him say,

source: བདག་ཅག་གི་བཟའ་བ་དང་བཅའ་བ་སྟ་གོན་བྱས་པ་དེ་དག་ཐམས་ཅད་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དང་བཅས་པ་ལ་ཕུལ་ལོ་ཞེས་ཐོས་སོ། །
en: ‘I offered all the food and drink that was prepared for us to the totally and completely awakened Buddha Kāśyapa and his disciples.’

source: དེ་ཐོས་མ་ཐག་ཏུ་དེ་དག་ཤས་ཆེར་ཁྲོས་ཏེ། དེ་དག་ཁྲོས་ནས་ཁྱེའུ་དེ་བསད་པར་བྱས་སོ། །
en: As soon as they heard this, they began to seethe with anger, and in their anger prepared to kill the young man.

source: དེ་ནས་ཁྱེའུ་དེ་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་ནས།
en: “The young man was terrified,

source: དྲང་སྲོང་སྨྲ་བར་སོང་སྟེ།
en: so he fled to Ṛṣivadana where

source: དེས་གནས་དེ་ནས་ཕ་མ་གཉིས་ལ་བཟླུགས་ཏེ།
en: he begged his parents,

source: ཕ་མ་གཉིས་ཀྱིས་འཐབ་མོ་ཞི་བར་བྱ་བར་བརྩམས་པ་ལས།
en: ‘Mother, Father, please pacify this quarrel!’

source: ཞི་བར་བྱེད་མ་ནུས་ནས།
en: They were unable to do so,

source: ཁྱེའུ་དེས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ།
en: so the young man asked for his parents’ permission and

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: went forth in the teaching of the totally and completely awakened Buddha Kāśyapa.

source: དེ་རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་ལོབས་ཏེ་རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་གྱུར་ནས།
en: Having gone forth, he studied the Tripiṭaka and became a proponent of the Dharma with all the eloquence of his wisdom and freedom.

source: དེས་ཕ་མ་གཉིས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་བཀོད་ནས། སྦྱིན་པ་དག་དང་། སྦྱིན་པའི་བགོ་བཤའ་བྱེད་དུ་བཅུག་གོ། །
en: He led his parents to go for refuge and maintain the fundamental precepts, to give gifts, and to share what they had.

source: དེ་ནས་མཛའ་སྡེ་བོ་དེ་རྣམས་ཀྱིས་དེ་རབ་ཏུ་བྱུང་བ་མཐོང་ནས། འགྱོད་པ་སྐྱེས་ཏེ།
en: “When the social club saw that he had gone forth they experienced regret and thought,

source: བདག་ཅག་གིས་མ་ལེགས་པ་བྱས་སོ། །
en: ‘We have done something wrong.’

source: སྙམ་ནས། དེ་དག་གིས་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ།
en: They bowed down at his feet,

source: བཟོད་པ་གསོལ་ཏོ། །
en: asked his forgiveness,

source: དེ་ལས་སྐྱབས་སུ་འགྲོ་བ་དང་།
en: went for refuge, and

source: བསླབ་པའི་གཞི་རྣམས་ཀྱང་བླངས་སོ། །
en: received the fundamental precepts from him.

source: དེ་ནས་ཕྱི་ཞིག་ན་དགེ་སློང་དེ་ནད་ཀྱིས་ཐེབས་ནས།
en: “One day the monk fell ill.

source: དེ་རྩ་བ་དང་སྡོང་བུ་དང་། ལོ་མ་དང་མེ་ཏོག་དང་། འབྲས་བུའི་སྨན་རྣམས་ཀྱིས་རིམ་གྲོ་བྱས་ཀྱང་། སོས་པར་བྱེད་མ་ནུས་ཏེ།
en: He was treated with medicinal roots, stems, leaves, flowers, and fruits, but he could not be cured.

source: དེས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: At the time of his death, he prayed,

source: ཀྱེ་མ་འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ན
en: ‘While I may not have attained any great virtues, still I have gone forth like this in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life.

source: དེའི་ཕ་མ་གཉིས་དང་མཛའ་སྡེ་བོ་དེ་རྣམས་ཀྱང་དེའི་མདུན་དུ་འདུག་པར་གྱུར་ཏེ།
en: “His parents and his social club sat before him,

source: དེ་རྣམས་ཀྱིས་ཀྱང་ཐོས་ནས་སྨོན་ལམ་བཏབ་པ། བདག་ཅག་ཀྱང་ཁྱོད་ཁོ་ན་ལ་བརྟེན་ཏེ།
en: and when they heard him they too began to pray,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་རྣམས་ཀྱིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: ‘Entrusting ourselves to you alone, may we too please and not displease the Blessed One.’

source: དེའི་ཚེ་སྡེ་སྣོད་གསུམ་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། ཁྱིམ་བདག་གི་བུ་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was that monk and Tripiṭaka master then is none other than this householder’s son.

source: དེའི་ཚེ་ཕ་མ་གཉིས་སུ་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི་ད་ལྟར་གྱི་ཕ་མ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: The ones who were his parents then are none other than his parents now.

source: དེའི་ཚེ་མཛའ་སྡེ་བོར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། ད་ལྟར་གྱི་ནེའུ་ལྡངས་ལྔ་བརྒྱ་པོ་འདི་དག་ཁོ་ན་ཡིན་ནོ། །
en: The ones who were in that social club are now his five hundred friends of the same age.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: The acts of practicing pure conduct all his life and saying that prayer at the time of his death ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth.

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་། ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—
